import random
# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне.


# Пример:
# Дано: ["яблоко", "банан", "киви", "арбуз"]
# Вывод:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Подсказка: воспользоваться методом .format()

fruits = {"яблоко".rjust(10), "банан".rjust(10), "киви".rjust(10), "арбуз".rjust(10)}
for index, name in enumerate(fruits, start = 1):
    print(index, name)

# Задача-2:
# Даны два произвольные списка.
# Удалите из первого списка элементы, присутствующие во втором списке.

a = {1, 2, 3, 4, 5, 6, 7, 8}
b = {5, 6, 7, 8, 9, 0}
print(a-b)



# Задача-3:
# Дан произвольный список из целых чисел.
# Получите НОВЫЙ список из элементов исходного, выполнив следующие условия:
# если элемент кратен двум, то разделить его на 4, если не кратен, то умножить на два.

list = []
n = 0
while n < 10:
    number = random.randint(0,10)
    list.append(number)
    n+=1
print(list)
newlist = [0]*10
i = 0
while i < 10:
    if list[i]%2 == 0:
        newlist[i] = list[i] / 4
        i+=1
    else:
        newlist[i] = list[i] * 2
        i += 1
print(newlist)