# Задача-1:
# Напишите небольшую консольную утилиту,
# позволяющую работать с папками текущей директории.
# Утилита должна иметь меню выбора действия, в котором будут пункты:
# 1. Перейти в папку
# 2. Просмотреть содержимое текущей папки
# 3. Удалить папку
# 4. Создать папку
# При выборе пунктов 1, 3, 4 программа запрашивает название папки
# и выводит результат действия: "Успешно создано/удалено/перешел",
# "Невозможно создать/удалить/перейти"

# Для решения данной задачи используйте алгоритмы из задания easy,
# оформленные в виде соответствующих функций,
# и импортированные в данный файл из easy.py
import easy
while True:
    try:
        choice = int(input('\n\nЧто бы вы хотели сделать?\n\n'
                       '1.Перейти в папку\n'
                       '2.Просмотреть содержимое текущей папки\n'
                       '3.Удалить папку\n'
                       '4.Создать папку\n'
                       '5.Выход\n'
                       '______________________'))

        if choice == 1:
            easy.move_to()
        elif choice == 2:
            easy.folders_list()
        elif choice == 3:
            easy.folder_delete()
        elif choice == 4:
            folder_name = input("Введите желаемое имя новой папки: ")
            easy.folder_creation(folder_name)
        elif choice == 5:
            print('Пока')
            break
        else:
            print('\nВведен неправильный символ!')
    except ValueError:
        print('\nВведен неправильный символ!')