# Задание - 1
# Вам даны 2 списка одинаковой длины, в первом списке имена людей, во втором зарплаты,
# вам необходимо получить на выходе словарь, где ключ - имя, значение - зарплата.
# Запишите результаты в файл salary.txt так, чтобы на каждой строке было 2 столбца,
# столбцы разделяются пробелом, тире, пробелом. в первом имя, во втором зарплата, например: Vasya - 5000
# После чего прочитайте файл, выведите построчно имя и зарплату минус 13% (налоги ведь),
# Есть условие, не отображать людей получающих более зарплату 500000, как именно
#  выполнить условие решать вам, можете не писать в файл
# можете не выводить, подумайте какой способ будет наиболее правильным и оптимальным,
#  если скажем эти файлы потом придется передавать.
# Так же при выводе имя должно быть полностью в верхнем регистре!
# Подумайте вспоминая урок, как это можно сделать максимально кратко, используя возможности языка Python.
import os
names = ["Иван", "Мария", "александр", "Алексей"]
salaries = ["100000", "200000", "300000", "600000"]
result = zip(names, salaries)
# print(dict(result))

result = dict(result)
print(result)
file = open('salary.txt', 'w')
for key, val in result.items():
        if int(val) < 500000:
            file.write(f'{key} - {val}\n')
file.close()

def salary_tax():
    with open("salary.txt") as tax:
        for line in tax.readlines():
            key, val = line.strip().split(' - ')
            print(f"{key.title()} - {float(val) * 0.87}")
salary_tax()