# Задание - 1
# Создайте функцию, принимающую на вход Имя, возраст и город проживания человека
# Функция должна возвращать строку вида "Василий, 21 год(а), проживает в городе Москва"

def questions(name = "Василий", age = "21", city = "Москва"):
    name = input("Введите Ваше имя: ")
    age = input("Сколько Вам лет: ")
    city = input("Где вы живете: ")
    print(name, age, "год(а), проживает в городе", city)


questions()

# Задание - 2
# Создайте функцию, принимающую на вход 3 числа, и возвращающую наибольшее из них

def number():
    a = int(input("Введите первое число: "))
    b = int(input("Введите второе число: "))
    c = int(input("Введите третье число: "))
    print(max(a,b,c))
number()

# Задание - 3
# Создайте функцию, принимающую неограниченное количество строковых аргументов,
# верните самую длинную строку из полученных аргументов


def words(*args):
    print(max(args, key = len))

words("sdfsdfsdf", "asdf", "kwugfweflkewfb")
