# Задача - 1
# Запросите у пользователя имя, фамилию, email. Теперь необходимо совершить проверки, имя и фамилия должны иметь заглавные
# первые буквы.
# email - не должен иметь заглавных букв и должен быть в формате: текст в нижнем регистре, допускается нижнее
# подчеркивание и цифры, потом @, потом текст, допускаются цифры, точка, ru или org или com.
# Например:
# Пупкин василий - неверно указано имя, te$T@test.net - неверно указан email (спецсимвол, заглавная буква, .net),
#  te_4_st@test.com - верно указан.
import re
name = input("Введите имя: ")
surname = input("Введите фамилию: ")
mail = input("Введите адрес вашего email: ")
pattern = "^[A-Z][a-z]+$"
check = re.search(pattern, name)
if check == None:
    print("неверно указано имя")
check = re.match(pattern, surname)
if check == None:
    print("неверно указана фамилия")
pattern = "^([a-z0-9_]+)@([a-z0-9]+\.)(ru|org|com)$"
check = re.search(pattern, mail)
if check == None:
    print("Неверно указан email")

some_str = '''
Мороз и солнце; день чудесный!
Еще ты дремлешь, друг прелестный —
Пора, красавица, проснись:
Открой сомкнуты негой взоры
Навстречу северной Авроры,
Звездою севера явись!
Вечор, ты помнишь, вьюга злилась,
На мутном небе мгла носилась;
Луна, как бледное пятно,
Сквозь тучи мрачные желтела,
И ты печальная сидела —
А нынче... погляди в окно:
Под голубыми небесами
Великолепными коврами,
Блестя на солнце, снег лежит;
Прозрачный лес один чернеет,
И ель сквозь иней зеленеет,
И речка подо льдом блестит.
Вся комната янтарным блеском
Озарена. Веселым треском
Трещит затопленная печь.
Приятно думать у лежанки.
Но знаешь: не велеть ли в санки
Кобылку бурую запречь?
Скользя по утреннему снегу,
Друг милый, предадимся бегу
Нетерпеливого коня
И навестим поля пустые,
Леса, недавно столь густые,
И берег, милый для меня.'''
pattern = "\.{2}"
check2 = re.search(pattern, some_str)
if check2 == None:
    print("В тексте нет мест с двумя и более точками!")
else:
    print("В тексте есть места с двумя и более точками!")

# Необходимо с помощью регулярных выражений определить есть ли в тексте подряд
# более одной точки, при любом исходе сообщите результат пользователю!